from django.shortcuts import render

# 구인 커뮤니티(구인글/자유소통, all/관심분야/경력/신입 url parameter로 구분)
# def employ_list(request,category1,)
    # 구인글 일때
        #all
            #조회수 많은거 4개
            # 전체
        #관심분야
            #조회수 많은거 4개
            # 전체
        #경력/신입
            #조회수 많은거 4개
            # 전체


    # 자유소통 일때
        #all
            #조회수 많은거 4개
            # 전체


#게시물 상세(id, 모집공고/Q&A)
    #회사
    #모집공고 일때
        #구인글
    #Q&A일때
        #Q&A list

#구인글 작성
    #해시태그 저장 함수 utls에서 찾아서 사용

#구인글 수정
    #해시태그 저장 함수 utls에서 찾아서 사용

#구인글 삭제


#구인/자유소통 작성
    #해시태그 저장 함수 utls에서 찾아서 사용

#구인/자유소통 수정
    #해시태그 저장 함수 utls에서 찾아서 사용

#구인/자유소통 삭제

#Q&A 상세(게시물id,Q&Aid)
    #게시물 요약
    #질문
    #답변

#Q&A 질문 작성(게시물 id)

#Q&A 질문 삭제?(질문 id)

#Q&A 답변 작성(질문 id)

#Q&A 답변 삭제?(답변 id)


